{
  "bufferline.nvim": { "branch": "main" },
  "dashboard-nvim": { "branch": "master" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "mini.bufremove": { "branch": "main" },
  "mini.files": { "branch": "main" },
  "mini.indentscope": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "persistence.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "tokyonight.nvim": { "branch": "main" },
  "vim-startuptime": { "branch": "master" },
  "which-key.nvim": { "branch": "main" }
}